# Целочисленный тип данных
# x = 1 - целочисленный литерал, питон присваивает ему int
# Ниже представлены все целочисленные операторы

# a = 13
# b = 7
#
# total = a + b
# diff = a - b
# prod = a * b
# div1 = a / b
# div2 = a // b
# mod = a % b
# exp = a ** b
#
# print(a, '+', b, '=', total)
# print(a, '-', b, '=', diff)
# print(a, '*', b, '=', prod)
# print(a, '/', b, '=', div1)
# print(a, '//', b, '=', div2)
# print(a, '%', b, '=', mod)
# print(a, '**', b, '=', exp)
#
# # В Python размер числа ограничен лишь производительностью компьютера
#
# atom = 10 ** 80  # количество атомов во вселенной
# print('Количество атомов =', atom)
#
# # Для удобного чтения чисел можно использовать нижнее подчеркивание
# num1 = 25_000_000
# num2 = 25000000
# print(num1)
# print(num2)
#
# # Числа с плавающей точки или дробные числа представлены типом данных - float
# e = 2.71828  # литерал с плавающей точкой
# pi = 3.1415  # литерал с плавающей точкой
#
# # Арифметические операторы для дробных чисел
# a = 13.5
# b = 2.0
#
# total = a + b
# diff = a - b
# prod = a * b
# div = a / b
# exp = a ** b
#
# print(a, '+', b, '=', total)
# print(a, '-', b, '=', diff)
# print(a, '*', b, '=', prod)
# print(a, '/', b, '=', div)
# print(a, '**', b, '=', exp)
#
# # Преобразование числа с плавающей точкой
# # Питон может автоматически преобразовать целое число в дромное, но не наоборот
# # Преобразование дробного числа в целое происходит с округлением в сторону 0
# # Не путить преобразование с округлением
# num1 = 17.89
# num2 = -13.56
# num3 = int(num1)
# num4 = int(num2)
# print(num3)
# print(num4)
#
# x = float(input())
# print(x - int(x))

# min max example 1
# a = max(3, 8, -3, 12, 9)
# b = min(3, 8, -3, 12, 9)
# c = max(3.14, 2.17, 9.8)
# print(a)
# print(b)
# print(c)

# abs - абсолютное число
# print(abs(10))
# print(abs(-7))
# print(abs(0))
# print(abs(-17.67))