#Команда print выводит текст на экран аргументы и параметры указанные внутри круглых скобок
print('Hello world!')

#Разделительная строка между примерами кода
print()

#Несколько аргументов в одной команде указываются через запятую
#Pep 8 после запятой ставить один пробел
print('Hello', 'World', '!')
print()

#Каждая следующая команда выводит текст с новой строки
print('Где справедливость? Уж который год')
print('Жители России, очень мирный народ')
print('Страдают от того, что старый вампир')
print('Обкрадывал их и кровь у них пил!')
print()

#Одинарные кавычки в тексте обрамляются в коде двойными кавычками и наоборот
print("I'm fine.", " Word 'Fine' mean allright!")
print('путин "легитимный" президент')
print()

#Команда input позволяет ввести данные, которые можно использовать в коде
name = input("What's your name? ")
print('Hi,', name)
print()

#Пример с вводом нескольких строк параметров и выводом этих параметров
One = input()
Two = input()
Three = input()
print(One)
print(Two)
print(Three)